# -*- coding: utf-8 -*-
"""
Задание 7.3a

Сделать копию скрипта задания 7.3.

Переделать скрипт: Отсортировать вывод по номеру VLAN

В результате должен получиться такой вывод:
10       01ab.c5d0.70d0      Gi0/8
10       0a1b.1c80.7000      Gi0/4
100      01bb.c580.7000      Gi0/1
200      0a4b.c380.7c00      Gi0/2
200      1a4b.c580.7000      Gi0/6
300      0a1b.5c80.70f0      Gi0/7
300      a2ab.c5a0.700e      Gi0/3
500      02b1.3c80.7b00      Gi0/5
1000     0a4b.c380.7d00      Gi0/9

Обратите внимание на vlan 1000 - он должен выводиться последним.
Правильной сортировки можно добиться, если vlan будет числом, а не строкой.

Подсказка: Для сортировки удобно сначала создать список списков такого типа,
а потом сортировать.

[[100, '01bb.c580.7000', 'Gi0/1'],
 [200, '0a4b.c380.7c00', 'Gi0/2'],
 [300, 'a2ab.c5a0.700e', 'Gi0/3'],
 [10, '0a1b.1c80.7000', 'Gi0/4'],
 [500, '02b1.3c80.7b00', 'Gi0/5'],
 [200, '1a4b.c580.7000', 'Gi0/6'],
 [300, '0a1b.5c80.70f0', 'Gi0/7'],
 [10, '01ab.c5d0.70d0', 'Gi0/8'],
 [1000, '0a4b.c380.7d00', 'Gi0/9']]

Сортировка должна быть по первому элементу (vlan), а если первый элемент одинаковый,
то по второму. Так работает по умолчанию функция sorted и метод sort, если сортировать
список списков выше.

Ограничение: Все задания надо выполнять используя только пройденные темы.

"""
filename = 'CAM_table.txt'

# Список для хранения данных
cam_table = []

# Читаем файл
with open(filename, "r") as file:
    for line in file:
        # Убираем лишние пробелы и разбиваем строку на части
        parts = line.split()
        
        # Проверка: строка должна содержать 4 элемента, где первый - VLAN ID
        if len(parts) == 4 and parts[0].isdigit():
            vlan = int(parts[0])        # Преобразуем VLAN в число для сортировки
            mac = parts[1]
            interface = parts[3]
            
            # Добавляем кортеж (vlan, mac, interface) в список
            cam_table.append((vlan, mac, interface))

# Сортируем список по VLAN
cam_table.sort()

# Выводим отсортированную таблицу
for vlan, mac, interface in cam_table:
    print(f"{vlan:<8}{mac:<20}{interface}")
